.site/content/career-change-week-0.md
+++
title = "Career Change - Week 0"
author = ["James"]
date = 2025-12-28T13:19:00+00:00
draft = false
+++

## Nitro Boost ( for a head start ) {#nitro-boost--for-a-head-start}

I gave myself a head start here, an initial "nitro boost" if you will.
So instead of starting on the 1st of January 2026 like any other "New Year's Resolution" project.
I dived right in, the very next day after making my [12 weeks plan](/12-weeks-action-plan-for-my-career-change/#week-11-12-interview-drill) ( 2025-12-28 ).


## Virtual Machine {#virtual-machine}

<span class="timestamp-wrapper"><span class="timestamp">[2025-12-28 Sun]</span></span>

**Objective:**<br />
Set up Virtual Machine and install a distro that's used for servers.

[Here](/setting-up-vm-for-enterprise-environment/#components-for-the-stack) is how I do it for my purpose.


## Review {#review}

<span class="timestamp-wrapper"><span class="timestamp">[2026-01-02 Fri]</span></span>

It turns out that I haven't manage to do much for Week 0, which is okay.
This project was not meant to be rushed, it would be better if I am able to
execute objectives properly rather than ticking off a list as fast as I can.

New year has already begun as the time of writing this. I have been quite anxious
about the future and my current state. I fear that I am not able to complete this project
in time, with the level of standard that I aim for. But worries stay as worries if no action
is taken. And I've already began taking actions. So the right thing to do right now is to
look forward and keep pushing for what I believe in.
